---
title: DHCPv4
publishDate: "2023-03-18T00:00:00"
author: José Aular
tag: Cisco
heroImage:
  src: https://res.cloudinary.com/jaular/image/upload/v1679327322/blog/dhcpv4/pkt-1_reipuc.png
  author: jaular14
---

import CustomLink from "~/components/CustomLink.astro";
import CustomImage from "~/components/CustomImage.astro";
export const components = { a: CustomLink, img: CustomImage };

## Tabla de contenido

1.  [Concepto](/blog/dhcpv4#concepto)
2.  [R1](/blog/dhcpv4#r1)
3.  [PC](/blog/dhcpv4#pc)
4.  [Mostrar información](/blog/dhcpv4#mostrar-información)
5.  [Referencias](/blog/dhcpv4#referencias)

## Concepto

Dynamic Host Configuration Protocol v4 (DHCPv4) asigna direcciones IPv4 y otra información de configuración de red dinámicamente. Dado que los clientes de escritorio suelen componer gran parte de los nodos de red, DHCPv4 es una herramienta extremadamente útil para los administradores de red y que ahorra mucho tiempo.

## R1

### Excluir direcciones IPv4

Utilice el comando `ip dhcp excluded-address {low-address} [high-address]` para excluir una única dirección o un rango de direcciones especificando la dirección más baja y la dirección más alta del rango.

```js title="R1"
R1(config)# ip dhcp excluded-address 192.168.10.1 192.168.10.50
```

### Definir un nombre de grupo DHCPv4

El comando `ip dhcp pool {pool-name}` crea el nombre y coloca al router en el modo de configuración de DHCPv4.

> Para deshabilitar el servicio DHCP use el comando `no service dhcp`.

```js title="R1"
R1(config)# ip dhcp pool LAN-POOL-1
```

### Configurar el grupo DHCPv4

Use los comandos `network {ip-address} {subnet-mask}` para definir el rango de direcciones disponibles, `default-router {ip-address}` para asignar la puerta de enlace predeterminada y `domain-name {name}` para crear el nombre de dominio.

```js title="R1"
R1(dhcp-config)# network 192.168.10.0 255.255.255.0
R1(dhcp-config)# default-router 192.168.10.1
R1(dhcp-config)# domain-name jaular.com
```

Realice los pasos anteriores para crear **LAN-POOL-2**.

### Asignar direcciones IPv4

Interfaz G0/0.

```js title="R1"
R1(config)# interface GigabitEthernet 0/0

// LAN-POOL-1
```

```js title="R1"
R1(config-if)# ip address 192.168.10.10 255.255.255.0
R1(config-if)# no shutdown
```

Interfaz G0/1.

```js title="R1"
R1(config)# interface GigabitEthernet 0/1

// LAN-POOL-2
```

```js title="R1"
R1(config-if)# ip address 192.168.20.10 255.255.255.0
R1(config-if)# no shutdown
```

## PC

Habilitar DHCP en todas las computadoras.

![Habilitar DHCP](https://res.cloudinary.com/jaular/image/upload/v1679327845/blog/dhcpv4/pkt-2_yhywn0.png "Habilitar DHCP")

---

![Verificar información](https://res.cloudinary.com/jaular/image/upload/v1679327845/blog/dhcpv4/pkt-3_jez2qp.png "Verificar información")

## Mostrar información

### Verificar el direccionamiento IPv4

Utilice el comando `show running-config | section dhcp` para mostrar los comandos de DHCPv4 configurados en el equipo.

```js title="R1"
R1# show running-config | section dhcp
```

El siguiente es un resultado de muestra del comando `show running-config | section dhcp`.

```js title="R1" {3,7}
ip dhcp excluded-address 192.168.10.1 192.168.10.50
ip dhcp excluded-address 192.168.20.1 192.168.20.50
ip dhcp pool LAN-POOL-1
 network 192.168.10.0 255.255.255.0
 default-router 192.168.10.1
 domain-name jaular.com
ip dhcp pool LAN-POOL-2
 network 192.168.20.0 255.255.255.0
 default-router 192.168.20.1
 domain-name jaular.com
```

### Verificar las asignaciones de DHCP

Utilice el `show ip dhcp binding` para mostrar una lista de todas las vinculaciones de la dirección IPv4 con la dirección MAC que fueron proporcionadas por el servicio DHCPv4

```js title="R1"
R1# show ip dhcp binding
```

El siguiente es un resultado de muestra del comando `show ip dhcp binding`.

```js title="R1" {3-6}
IP address       Client-ID/              Lease expiration        Type
                 Hardware address
192.168.10.51    00D0.97C8.678D           --                     Automatic
192.168.10.52    00D0.BA34.A29C           --                     Automatic
192.168.20.52    0004.9AC0.7702           --                     Automatic
192.168.20.51    00D0.FFC1.E5CE           --                     Automatic
```

## Referencias

- [Cisco Networking Academy](https://www.netacad.com/)
