---
title: Packet Tracer - Implementar una red pequeña
publishDate: "2023-02-26T00:00:00"
author: José Aular
tag: cisco
---

import CustomImage from "~/components/CustomImage.astro";
import CustomTable from "~/components/CustomTable.astro";
export const components = { img: CustomImage, table: CustomTable };

## Tabla de contenido

1.  [Tablas de información](/blog/packet-tracer-implementar-red-pequeña#tablas-de-información)
2.  [Topología lógica](/blog/packet-tracer-implementar-red-pequeña#topología-lógica)
3.  [RTA](/blog/packet-tracer-implementar-red-pequeña#rta)
4.  [SW1](/blog/packet-tracer-implementar-red-pequeña#sw1)
5.  [SW2](/blog/packet-tracer-implementar-red-pequeña#sw2)
6.  [Resultado](/blog/packet-tracer-implementar-red-pequeña#resultado)

## Tablas de información

Tabla de asignación de direcciones

| Dispositivo | Interfaz        | Dirección                   | Máscara de subred                 | Puerta de enlace predeterminada |
| ----------- | --------------- | --------------------------- | --------------------------------- | ------------------------------- |
| RTA         | G0/0 <br/> G0/1 | 10.10.10.1 <br/> 10.10.20.1 | 255.255.255.0 <br/> 255.255.255.0 | N/D <br/> N/D                   |
| SW1         | VLAN1           | 10.10.10.2                  | 255.255.255.0                     | **10.10.10.1**                  |
| SW2         | VLAN1           | 10.10.20.2                  | 255.255.255.0                     | **10.10.20.1**                  |
| PC-1        | NIC             | **10.10.10.21**             | 255.255.255.0                     | **10.10.10.1**                  |
| PC-2        | NIC             | **10.10.20.21**             | 255.255.255.0                     | **10.10.20.1**                  |

Tabla de conexión de los dispositivos

| Desde el dispositivo | Interfaz        | Hacia el dispositivo | Interfaz        |
| -------------------- | --------------- | -------------------- | --------------- |
| RTA                  | G0/0 <br/> G0/1 | SW1 <br/> SW2        | G0/1 <br/> G0/1 |
| SW1                  | F0/1            | PC-1                 | Fastethernet0   |
| SW2                  | F0/1            | PC-2                 | Fastethernet0   |

## Topología lógica

![Topología lógica](https://res.cloudinary.com/jaular/image/upload/v1677519652/blog/packet-tracer-implementar-red-peque%C3%B1a/pkt-1_qrp36b.png "Topología lógica")

## RTA

```js title="RTA"
Router>
Router> enable
Router# configure terminal
Router(config)# hostname RTA
RTA(config)# enable secret Ciscoenpa55
RTA(config)# line console 0
RTA(config-line)# password Ciscolinepa55
RTA(config-line)# login
RTA(config-line)# exit
RTA(config)# line vty 0 4
RTA(config-line)# password Ciscolinepa55
RTA(config-line)# login
RTA(config-line)# exit
RTA(config)# banner motd #SOLO USUARIOS AUTORIZADOS#
```

Interfaz G0/0

```js title="RTA"
RTA(config)# interface gigabitEthernet 0/0
```

```js title="RTA"
RTA(config-if)# ip address 10.10.10.1 255.255.255.0
RTA(config-if)# no shutdown
RTA(config-if)# description ENLACE CON SW1
RTA(config-if)# exit
```

Interfaz G0/1

```js title="RTA"
RTA(config)# interface gigabitEthernet 0/1
```

```js title="RTA"
RTA(config-if)# ip address 10.10.20.1 255.255.255.0
RTA(config-if)# no shutdown
RTA(config-if)# description ENLACE CON SW2
RTA(config-if)# end
```

Guardar configuración

```js title="RTA"
RTA# copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
```

## SW1

```js title="SW1"
Switch>
Switch> enable
Switch# configure terminal
Switch(config)# hostname SW1
SW1(config)# enable secret Ciscoenpa55
SW1(config)# line console 0
SW1(config-line)# password Ciscolinepa55
SW1(config-line)# login
SW1(config-line)# exit
SW1(config)# line vty 0 15
SW1(config-line)# password Ciscolinepa55
SW1(config-line)# login
SW1(config-line)# exit
```

VLAN 1

```js title="SW1"
SW1(config)# interface vlan 1
```

```js title="SW1"
SW1(config-if)# ip address 10.10.10.2 255.255.255.0
SW1(config-if)# no shutdown
SW1(config-if)# ip default-gateway 10.10.10.1
SW1(config-if)# end
```

Guardar configuración

```js title="SW1"
SW1# copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
```

## SW2

```js title="SW2"
Switch>
Switch> enable
Switch# configure terminal
Switch(config)# hostname SW2
SW2(config)# enable secret Ciscoenpa55
SW2(config)# line console 0
SW2(config-line)# password Ciscolinepa55
SW2(config-line)# login
SW2(config-line)# exit
SW2(config)# line vty 0 15
SW2(config-line)# password Ciscolinepa55
SW2(config-line)# login
SW2(config-line)# exit
```

VLAN 1

```js title="SW2"
SW2(config)# interface vlan 1
```

```js title="SW2"
SW2(config-if)# ip address 10.10.20.2 255.255.255.0
SW2(config-if)# no shutdown
SW2(config-if)# ip default-gateway 10.10.20.1
SW2(config-line)# end
```

Guardar configuración

```js title="SW2"
SW2# copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
```

## Resultado

> Recuerde asignar una dirección IP en los equipos **PC-1** y **PC-2**.

![Verificar configuración](https://res.cloudinary.com/jaular/image/upload/v1677519652/blog/packet-tracer-implementar-red-peque%C3%B1a/pkt-2_dc8rby.png "Verificar configuración")

---

![Puntaje](https://res.cloudinary.com/jaular/image/upload/v1677519829/blog/packet-tracer-implementar-red-peque%C3%B1a/pkt-3_eocakr.png "Puntaje")
